howto_sav/app/controllers/contrats_controller.rb

SELECT * FROM `contrats` WHERE (`contrats`.`id` = 7)
---
  def show
    @contrat = Contrat.find(params[:id])