howto_sav/app/controllers/divisions_controller.rb

SELECT * FROM `divisions` WHERE (`divisions`.`id` = 1)
SELECT * FROM `saisons` WHERE (`saisons`.`id` IN (6,7,8,1,2,3,4,5))
SELECT `historiques`.* FROM `historiques` WHERE (`historiques`.saison_id IN (1,2,3,4,5,6,7,8))
---
  def show
#    @division = Division.find(params[:id])
	#@division = Equipe.find(:all, :include => [:saisons => :historiques, :divisions => :saisons],
    #               		 :conditions => ["divisions.id = ?", params[:id]])

  #  @division = Equipe.find(:all, :include => [:saisons => :historiques],
	#							:conditions =>["saisons.id =?",params[:id]])
    #:posts => [{:comments => :guest}

    @equipe = Equipe.find(:all, :include => [:saisons => :historiques],
								:conditions =>["saisons.division_id =?",params[:id]])