howto_sav/app/controllers/equipes_controller.rb

SELECT * FROM `equipes` WHERE (`equipes`.`id` = 1)
SELECT * FROM `joueurs` WHERE (`joueurs`.`id` = 1)
---
  def show
    @equipe = Equipe.find(params[:id])
  #  @joueurs = Joueur.find(:all, :include => self.id )
	#TODO rajouter le filtre pour trouver les joueurs dont la date de in de contrat < date courante
    @joueurs = Joueur.find(:all, :include => [:equipes => :contrats],
                    		 :conditions => ["equipes.id = ?", params[:id]])

SELECT * FROM `equipes` WHERE (`equipes`.`id` = 17)
---
  def edit
    @equipe = Equipe.find(params[:id])